In [1]:
# Feature Scaling 
# StandardScaler

import pandas as pd
df=pd.read_csv('Simple.csv')
df.head()

    Name  Age  Gender       City Adult    Sal  Exp  Buy
0    Ram   56    male     mumbai   yes  20000    3    1
1  Shyam   12    male      delhi    no  43000    2    0
2  Lalit   30  female   parbhani   yes  22000    1    1
3    Raj   20    male  Banghlore   yes  15000    6    0
4   Ramu   15  female  Banghlore    no  34000    4    0

In [2]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()

new_column=['Age','Sal','Exp']
df[new_column]=scaler.fit_transform(df[new_column])
print(df)

    Name       Age  Gender       City Adult       Sal       Exp  Buy
0    Ram  2.274084    male     mumbai   yes -0.689115 -0.277350    1
1  Shyam -0.880952    male      delhi    no  0.649376 -0.762713    0
2  Lalit  0.409745  female   parbhani   yes -0.572724 -1.248075    1
3    Raj -0.307309    male  Banghlore   yes -0.980091  1.178738    0
4   Ramu -0.665835  female  Banghlore    no  0.125619  0.208013    0
5  Pintu -0.379014    male      delhi   yes -0.630920 -0.762713    1
6  Chiku -0.450719  female     mumbai   yes  2.097856  1.664101    1

In [3]:
df=df[['Name','Gender','City','Adult','Age','Sal','Exp','Buy']]
df.head()

    Name  Gender       City Adult       Age       Sal       Exp  Buy
0    Ram    male     mumbai   yes  2.274084 -0.689115 -0.277350    1
1  Shyam    male      delhi    no -0.880952  0.649376 -0.762713    0
2  Lalit  female   parbhani   yes  0.409745 -0.572724 -1.248075    1
3    Raj    male  Banghlore   yes -0.307309 -0.980091  1.178738    0
4   Ramu  female  Banghlore    no -0.665835  0.125619  0.208013    0

In [6]:
# Label Encoding

from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

df['adult_encode']=le.fit_transform(df['Adult'])
df

,Name,Gender,City,Adult,Age,Sal,Exp,Buy,adult_encode
0,Ram,male,mumbai,yes,2.274084,-0.689115,-0.277350,1,1
1,Shyam,male,delhi,no,-0.880952,0.649376,-0.762713,0,0
2,Lalit,female,parbhani,yes,0.409745,-0.572724,-1.248075,1,1
3,Raj,male,Banghlore,yes,-0.307309,-0.980091,1.178738,0,1
4,Ramu,female,Banghlore,no,-0.665835,0.125619,0.208013,0,0
5,Pintu,male,delhi,yes,-0.379014,-0.630920,-0.762713,1,1
6,Chiku,female,mumbai,yes,-0.450719,2.097856,1.664101,1,1

In [8]:
# Normalization (Min-Max Scaler) Ra

from sklearn.preprocessing import MinMaxScaler
mscaler=MinMaxScaler()

df[new_column]=mscaler.fit_transform(df[new_column])
df

,Name,Gender,City,Adult,Age,Sal,Exp,Buy,adult_encode
0,Ram,male,mumbai,yes,1.000000,0.094536,0.333333,1,1
1,Shyam,male,delhi,no,0.000000,0.529401,0.166667,0,0
2,Lalit,female,parbhani,yes,0.409091,0.132350,0.000000,1,1
3,Raj,male,Banghlore,yes,0.181818,0.000000,0.833333,0,1
4,Ramu,female,Banghlore,no,0.068182,0.359236,0.500000,0,0
5,Pintu,male,delhi,yes,0.159091,0.113443,0.166667,1,1
6,Chiku,female,mumbai,yes,0.136364,1.000000,1.000000,1,1